; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v9 ?v12)
             (pred_7 ?v4 ?v2)
             (pred_9 ?v9 ?v2)
             (pred_5 ?v7 ?v9 )
	     (pred_1 ?v9)
             (pred_3 ?v13)
             (pred_11 ?v4)
             (pred_10 ?v2)
             (pred_4 ?v9)
             (pred_12 ?v4)
             (pred_8 ?v9)
             (pred_2 ))



(:action op_3
:parameters (?v10 ?v8 ?v5 ?v3)
:precondition (and (pred_3 ?v10) (pred_3 ?v8) (pred_11 ?v5) (pred_10 ?v3)
          (pred_6 ?v10 ?v8) (pred_7 ?v5 ?v3)
                   (pred_9 ?v8 ?v3) (pred_1 ?v10) 
                   (pred_4 ?v8) (pred_12 ?v5))
:effect (and  (pred_8 ?v8) (not (pred_4 ?v8))))


(:action op_1
:parameters (?v10 ?v1)
:precondition (and (pred_3 ?v10) (pred_3 ?v1)
               (pred_1 ?v10) (pred_6 ?v10 ?v1) (pred_8 ?v1))
:effect (and (pred_1 ?v1) (not (pred_1 ?v10))))

(:action op_4
:parameters (?v10 ?v5)
:precondition (and (pred_3 ?v10) (pred_11 ?v5) 
                  (pred_1 ?v10) (pred_5 ?v5 ?v10) (pred_2 ))
:effect (and (pred_12 ?v5)
   (not (pred_5 ?v5 ?v10)) (not (pred_2 ))))


(:action op_5
:parameters (?v10 ?v11 ?v6)
:precondition (and (pred_3 ?v10) (pred_11 ?v11) (pred_11 ?v6)
                  (pred_1 ?v10) (pred_12 ?v6) (pred_5 ?v11 ?v10))
:effect (and (pred_12 ?v11) (pred_5 ?v6 ?v10)
        (not (pred_12 ?v6)) (not (pred_5 ?v11 ?v10))))

(:action op_2
:parameters (?v10 ?v5)
:precondition (and (pred_3 ?v10) (pred_11 ?v5) 
                  (pred_1 ?v10) (pred_12 ?v5))
:effect (and (pred_2 ) (pred_5 ?v5 ?v10) (not (pred_12 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_22 obj_12 obj_08 obj_17 obj_11 obj_21 obj_02 obj_18 obj_03 obj_20 obj_07 obj_10 obj_15 obj_13 obj_06
    obj_05 obj_14 obj_19
    obj_04 obj_09 obj_16
    )

    (:init
       (pred_2)

       (pred_3 obj_01)
       (pred_3 obj_22)
       (pred_3 obj_12)
       (pred_3 obj_08)
       (pred_3 obj_17)
       (pred_3 obj_11)
       (pred_3 obj_21)
       (pred_3 obj_02)
       (pred_3 obj_18)
       (pred_3 obj_03)
       (pred_3 obj_20)
       (pred_3 obj_07)
       (pred_3 obj_10)
       (pred_3 obj_15)
       (pred_3 obj_13)
       (pred_3 obj_06)
       (pred_10 obj_05)
       (pred_10 obj_14)
       (pred_10 obj_19)
       (pred_11 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_16)

       (pred_6 obj_01 obj_17)
       (pred_6 obj_01 obj_22)
       (pred_6 obj_22 obj_11)
       (pred_6 obj_22 obj_12)
       (pred_6 obj_22 obj_01)
       (pred_6 obj_12 obj_21)
       (pred_6 obj_12 obj_08)
       (pred_6 obj_12 obj_22)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_08 obj_12)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_17 obj_11)
       (pred_6 obj_17 obj_01)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_11 obj_21)
       (pred_6 obj_11 obj_22)
       (pred_6 obj_11 obj_17)
       (pred_6 obj_21 obj_20)
       (pred_6 obj_21 obj_02)
       (pred_6 obj_21 obj_12)
       (pred_6 obj_21 obj_11)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_02 obj_08)
       (pred_6 obj_02 obj_21)
       (pred_6 obj_18 obj_10)
       (pred_6 obj_18 obj_03)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_03 obj_15)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_03 obj_18)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_20 obj_21)
       (pred_6 obj_20 obj_03)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_07 obj_02)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_10 obj_15)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_15 obj_13)
       (pred_6 obj_15 obj_03)
       (pred_6 obj_15 obj_10)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_13 obj_15)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_06 obj_13)
       (pred_4 obj_03)
       (pred_4 obj_01)
       (pred_4 obj_10)
       (pred_9  obj_03 obj_05)
       (pred_9  obj_01 obj_14)
       (pred_9  obj_10 obj_19)
       (pred_8 obj_22)
       (pred_8 obj_12)
       (pred_8 obj_08)
       (pred_8 obj_17)
       (pred_8 obj_11)
       (pred_8 obj_21)
       (pred_8 obj_02)
       (pred_8 obj_18)
       (pred_8 obj_20)
       (pred_8 obj_07)
       (pred_8 obj_15)
       (pred_8 obj_13)
       (pred_8 obj_06)

       (pred_7  obj_04 obj_05)
       (pred_7  obj_09 obj_14)
       (pred_7  obj_16 obj_19)
       (pred_5 obj_04 obj_06)
       (pred_5 obj_09 obj_15)
       (pred_5 obj_16 obj_08)
       (pred_1 obj_22)
    )

    (:goal (and
       (pred_5 obj_04 obj_13)
       (pred_5 obj_09 obj_22)
    ))
(:constraints
  (always (not (pred_1 obj_20)))
)
)

; plan
1. (op_1 obj_22 obj_12)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_12)
   goals met: 0 of 2
2. (op_1 obj_12 obj_21)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_21)
   goals met: 0 of 2
3. (op_1 obj_21 obj_02)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_02)
   goals met: 0 of 2
4. (op_1 obj_02 obj_07)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_07)
   goals met: 0 of 2
5. (op_1 obj_07 obj_06)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_06)
   goals met: 0 of 2
6. (op_4 obj_06 obj_04)
   deleted: (pred_5 obj_04 obj_06) (pred_2)
   added: (pred_12 obj_04)
   goals met: 0 of 2
7. (op_1 obj_06 obj_13)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_13)
   goals met: 0 of 2
8. (op_2 obj_13 obj_04)
   deleted: (pred_12 obj_04)
   added: (pred_2) (pred_5 obj_04 obj_13)
   goals met: 1 of 2
9. (op_1 obj_13 obj_15)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_15)
   goals met: 1 of 2
10. (op_4 obj_15 obj_09)
   deleted: (pred_5 obj_09 obj_15) (pred_2)
   added: (pred_12 obj_09)
   goals met: 1 of 2
11. (op_1 obj_15 obj_13)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_13)
   goals met: 1 of 2
12. (op_1 obj_13 obj_06)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_06)
   goals met: 1 of 2
13. (op_1 obj_06 obj_07)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_07)
   goals met: 1 of 2
14. (op_1 obj_07 obj_02)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_02)
   goals met: 1 of 2
15. (op_1 obj_02 obj_08)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_08)
   goals met: 1 of 2
16. (op_1 obj_08 obj_12)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_12)
   goals met: 1 of 2
17. (op_1 obj_12 obj_22)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_22)
   goals met: 1 of 2
18. (op_2 obj_22 obj_09)
   deleted: (pred_12 obj_09)
   added: (pred_2) (pred_5 obj_09 obj_22)
   goals met: 2 of 2
